export default {
  or: "или",
  meta: {
    description: "Простой сайт-портфолио веб-разработчика",
  },
  error: {
    title: "Упс! Что-то пошло не так..",
    404: "Страница {url} не найдена!",
    other: "Проверьте валидность адреса и вводимых данных",
    button: "На главную",
  },
  hero: {
    title: "Привет, меня зовут Егор,",
    subtitle: "я — ",
    specialization: "Full-Stack Developer",
    github: "Мой GitHub",
    telegram: "Написать мне",
  },
  menu: {
    scroll_to_top: "Наверх",
    home: "Главная",
    projects: "Проекты",
    blog: "Блог",
    summary: "Обо мне",
    summary_desc: "Кратко обо всех аспектах, которые могут быть интересны",
    education: "Образование",
    education_desc: "Подробная информация о полученном образовании",
    experience: "Опыт работы",
    experience_desc:
      "Предыдущие места работы и кейсы, о которых можно рассказать",
    tech: "Технологии",
    tech_desc:
      "Список технологий, которыми я владею и активно применяю в своих проектах",
    contacts: "Контакты",
    contacts_desc:
      "Данные, по которым можно связаться со мной и форма обратной связи",
  },
  summary: {
    title: "Обо мне",
    text: "Высокомотивированный разработчик с двухлетним опытом работы в создании и поддержке веб-приложений. Владею широким спектром технологий. Пишу в основном на ",
    tech: ["VueJS", "ExpressJS", "Laravel", "SQL"],
    text2:
      "Основные знания в области веб-разработки были получены самостоятельно, по этому выбранный стек полностью обусловлен потребностью решить уже имеющуюся задачу. В личных проектак, помимо перечисленного, я активно использу",
    tech2: ["Docker", "NodeJS"],
    text3: "когда-то использовал",
    tech3: ["Javassist", ".NET C#"],
    text4:
      "Обладаю сильными аналитическими способностями, креативным подходом к решению задач и отличными коммуникативными навыками. Стремлюсь к постоянному совершенствованию и освоению новых технологий для достижения наилучших результатов. Ищу возможность применить и расширить свои навыки в составе динамичной команды разработчиков.",
  },
  education: {
    title: "Образование",
    text: "Я учился в Кубанском Государственном Университете по специальности",
    degree:
      "математическое обеспечение и администрирование информационных систем",
    text2: "В рамках обучения писал на: ",
    tech: [
      ".NET (C#, C++)",
      "Java",
      "ASM",
      "JavaScript",
      "PHP",
      "Python",
      "SQL/Oracle",
    ],
    text3:
      "Я бросил учебу на третьем курсе, потому что преподаваемые дисциплины были слишком теоретическими. Фактически на каждом курсе мы изучали основы ранее не изученных языков программирования, не изучая преимущества и особенности технологии. Почти все знания и навыки в веб-разработке были получены путем самостоятельного обучения.",
  },
  experience: {
    title: "Опыт работы",
    last: "Это может быть ваша компания",
  },
  stack: {
    title: "Технологии",
  },
  projects: {
    description: "Приложения, сервисы и утилиты, сделанные мной",
    document_not_found: "Проект не найден",
    source: "Код проекта",
    demo: "Демо"
  },
  contacts: {
    title: "Контакты",
    name: "Имя",
    email: "Email",
    message: "Сообщение",
    required: "Обязательное",
    submit: "Отправить",
    error: "Ошибка!",
    success: "Успешно!",
    success_desc: "Ваше сообщение было отправлено",
  },
  blog: {
    read_more: "Читать далее →",
    description: "Личные открытия, кейсы, интересные заметки",
    not_found: "Ничего не найдено",
    search_placeholder: "Поиск",
    document_not_found: "Документ не найден"
  },
};
