export default {
  title: 'Обо мне',
  lang: 'РУ',
  and: 'и',
  or: 'или',
  footer_text: 'сделано на Vue.js',
  to_top: 'Наверх',
  theme: {
    light: 'Светлая тема',
    dark: 'Тёмная тема',
    switch: 'Сменить тему'
  },
  hero: {
    title: 'Привет, меня зовут Егор,',
    subtitle: 'я — ',
    specialization: 'Full-Stack Developer',
    github: 'Мой GitHub',
    telegram: 'Написать мне'
  },
  about: {
    title1: 'Обо мне',
    title2: 'Образование',
    summary_text1:
      'Высокомотивированный разработчик с двухлетним опытом работы в создании и поддержке веб-приложений. Владею широким спектром технологий, включая ',
    summary_tech1: 'Vue',
    summary_tech2: 'Laravel',
    summary_tech3: 'Express.js',
    summary_tech4: 'SQL',
    summary_text2:
      'Обладаю сильными аналитическими способностями, креативным подходом к решению задач и отличными коммуникативными навыками. Стремлюсь к постоянному совершенствованию и освоению новых технологий для достижения наилучших результатов. Ищу возможность применить и расширить свои навыки в составе динамичной команды разработчико.',
    education_text1: 'Я учился в Кубанском Государственном Университете по специальности',
    education_degree:
      'Математическое обеспечение и администрирование информационных систем (02.03.03)',
    education_text2: 'В рамках обучения писал на: ',
    education_tech1: '.NET (C#, C++)',
    education_tech2: 'Java',
    education_tech3: 'ASM',
    education_tech4: 'JS',
    education_tech5: 'PHP',
    education_tech6: 'Python',
    education_tech7: 'SQL/Oracle',
    education_text3:
      'Я бросил учебу на третьем курсе, потому что преподаваемые дисциплины были слишком теоретическими. Фактически на каждом курсе мы изучали основы ранее не изученных языков программирования, не изучая преимущества и особенности технологии. Почти все знания и навыки в веб-разработке были получены путем самостоятельного обучения.'
  },
  experience: {
    title: 'Опыт работы',
    last: 'Это может быть ваша компания'
  },
  stack: {
    title: 'Технологии'
  },
  projects: {
    title: 'Проекты',
    show_all: 'Показать все',
    categories: 'Категории',
    stack: 'Технологии',
    details: 'Описание',
    search_placeholder: 'Поиск по тегам',
    search_not_found: 'По запросу «{query}» ничего не найдено...'
  },
  contacts: {
    title: 'Контакты',
    name: 'Имя',
    name_placeholder: 'Введите ваше имя',
    email: 'Email',
    email_placeholder: 'Введите email, на который я смогу ответить',
    message: 'Сообщение',
    message_placeholder: 'Введите сообщение',
    required: 'Обязательное',
    submit: 'Отправить'
  }
}
